import React, { Component } from 'react'

export default class IntroductionComponent extends Component {
    constructor(props) {
        super(props)
        this.state = {}
    }

    render() {
        return (
            <div>
                <h1>소개</h1>
                <div class="card">
                    <h5 class="card-header">S/W의 철학</h5>
                    <div class="card-body">
                        <p class="card-text">저의 철학은 "도전과 변화에 두려워하지 말자", "남을 시기하지 않고 자신만의 실력을 키우자", "사람을 존중하자" 입니다.
자기 자신을 성장시키기 위해 저만의 철학을 내세우며 인생의 과정을 겪고 있었습니다.
저의 목표는 소프트웨어 연구자가 되는 것입니다. 그동안 학창 시절 컴퓨터 관련 학과를 전공을 하며국가에서 지원하는 S/W 양성과정을 수료를 하면서, 부족한 개발 실력을 맺구기 위해 3년동안 개인시간을 만들어 알고리즘에 공부를 하여 효율적인 프로그래밍을 하는 과정과 또한 웹 개발 개인 프로젝트를 진행을 하여 방문자 늘리기에 진행을 하였습니다. 그 과정에 있어서 실패를 많이 겪었지만 이것이성장과정 중 하나라고 생각합니다.
저의 실패 요인은 무리한 계획과 도움없이 모든 것을 혼자서 해결하고, 시야를 좁게 본 것이 실패요인이라고 할 수 있으며, 그 실패 요인을 성공으로 바꾸기 위해 사람의 도움없이 필요하다고 느끼며, 도움을 통해 저의 단점을 장점으로 만들고 싶습니다.
이후, 회사 생활을 통해 성장을 하면서 차후 사람들에게 필요한 사람으로 각인 시키고 싶으며, 남을 시기하지 않고 어떠한 환경이 변하거나 불가능 한 것을 가능하게끔 하여 저의 실력으로 경쟁성 있는 모습으로 선배님들과 함께 하고 싶습니다.
</p>
                    </div>
                </div>

                <div class="card">
                    <h5 class="card-header">소통과 조직 융화력의 중요성 : 개방적, 오픈마인드</h5>
                    <div class="card-body">
                        <p class="card-text">저의 마음가짐을 바뀌게 한 사례가 있었습니다.
아르바이트 생활을 하면서 동료와 상급자들과 함께 일을 하고 나서부터입니다.
아르바이트 생활하기 이전에는 고집스럽고, 좁은 시야로 사람들을 대할 때였고, 한계치에 부딪치면 패배자로 삶을 살아왔습니다.
인생을 살면서 단점이 많았던 시기였고, 도전에 두려워 하며 할 수 있는 것들인데도 불구하고 불가능하다고 판단이 들어 바로 접어든 적도 많았습니다.
그것들은 어떻게 보면 욕망적으로 살아왔던 때가 있었습니다.
용돈이라도 벌기위해 물류센터 아르바이트라는 곳을 여러군데 하면서 저의 강점으로 만들었습니다.
저에게는 그 당시 성실함과 꾸준하게 남에게 피해를 끼치지 않게 할려는 의지는 누구보다 더 강했습니다.
하지만 저의 한계치가 다가오면서 본의 아니게 남에게 피해를 주는 행위가 발생하였고, 본의 아니게 텃세를 부리는 것들이 조금씩 보이고, 일하는 방식에서 효율적으로 일하는 방식이 아닌 잘 못 배워온방식으로 고집하는 경향이 강했습니다.
저는 상급자나 동료 직원들에게 뒤쳐지고 잘못된 습관을 바꿀려는 모습이 안보여준 덕분에 저로 인해힘들어했던 부분들이 많았던걸로 생각합니다.
그 상급자가 "잘 할려는 것과 잘하는 것은 다르다.", "열심히만 하는 것보다 효율적으로 일하는 것이사람들에게 인정을 받는다.", "모든 사람들에게 뒤쳐지거나 아래로 시작하면서 남들보다 더 잘해서 올라갈려는 도전을 해본적 있니?", "다른사람들이 할 수 없는 일들을 내가 해내면 남들이 보는 시선이달라질 것이다.", "가진게 많을 수록 공손해야한다.", "사람을 만들려면 개구리 올챙이 시절 생각해보기" 등 이런 말들로 통해 저의 마음가짐을 개선하기로 굳게 다짐하였습니다.
그런 말을 통해 제가 하고 싶은 일로 나열을 하면, 하루 1시간 이상 프로그래밍 하기, 개인 프로젝트마치고 사이트 오픈하기, 아는 것이 있어도 다시 처음 시작하는 마음으로 다가가기, 조직내에서 후임자보다 밑으로 내려가도 자존심 굽히고 남들보다 더 많이 하자. 다양한 사람을 만나도 편견을 가지지말고 오픈마인드로 다가가기
비록 그것이 어려운 과제가 되겠지만 실패를 성공으로 실패를 하더라도 성공할 때까지 끈기있게 도전을 하는 것이 저의 목표가 되고 하나가 되겠지만 노력만 하면 모든 것이 다 되듯이 하나를 목표를 잡았으면 초심잃지 않고 평정심을 유지하는 사람이 되고 싶고 다양한 사람들을 만나서 편견을 가지지 않고오픈마인드 유지를 하여 모든 사람들간의 소통하는 능력을 기르고 싶습니다.

</p>
                    </div>
                </div>
            </div>
        )
    }
}
